anthropic.claude-code
databricks.databricks
dracula-theme.theme-dracula
enkia.tokyo-night
github.copilot
github.copilot-chat
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode.makefile-tools
postman.postman-for-vscode
redhat.vscode-yaml
vscodevim.vim
