# Taps
tap "minio/stable"

# Binaries (Formulas)
brew "argocd"
brew "autojump"
brew "awscli"
brew "bash"
brew "bat"
brew "coreutils"
brew "gh"
brew "git"
brew "go"
brew "grep"
brew "jq"
brew "kind"
brew "kubernetes-cli"
brew "kustomize"
brew "mackup"
brew "mas"
brew "minio/stable/mc"
brew "neovim"
brew "pipx"
brew "pkg-config"
brew "podman"
brew "podman-compose"
brew "pre-commit"
brew "ripgrep"
brew "rust"
brew "task"
brew "tree"
brew "yarn"
brew "terraform"

# Spatie Medialibrary
brew "gifsicle"

# Apps (Casks)
cask "caffeine"
cask "github"
cask "google-chrome"
cask "imageoptim"
cask "qlmarkdown"
cask "visual-studio-code"
cask "warp"
cask "dbeaver-community"
cask "iterm2"

# Fonts
cask "font-fira-code-nerd-font"
