# Taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "minio/stable"
tap "stripe/stripe-cli"
tap "stripe/stripe-mock"

# Binaries (Formulas)
brew "1password-cli"
brew "argocd"
brew "autojump"
brew "awscli"
brew "bash"
brew "bat"
brew "coreutils"
brew "ffmpeg"
brew "gh"
brew "git"
brew "go"
brew "grep"
brew "httpie"
brew "imagemagick"
brew "jq"
brew "kind"
brew "kubernetes-cli"
brew "kustomize"
brew "mackup"
brew "mas"
brew "minio/stable/mc"
brew "neovim"
brew "pipx"
brew "pkg-config"
brew "podman"
brew "podman-compose"
brew "pre-commit"
brew "ripgrep"
brew "rust"
brew "stripe/stripe-cli/stripe"
brew "stripe/stripe-mock/stripe-mock"
brew "svn"
brew "task"
brew "tree"
brew "yarn"

# Spatie Medialibrary
brew "jpegoptim"
brew "optipng"
brew "pngquant"
brew "svgo"
brew "gifsicle"

# Apps (Casks)
cask "1password"
cask "caffeine"
cask "darktable"
cask "discord"
cask "docker"
cask "figma"
cask "firefox"
cask "github"
cask "google-chrome"
cask "helo"
cask "herd"
cask "httpie"
cask "imageoptim"
cask "loom"
cask "pastebot"
cask "qlmarkdown"
cask "quicklook-json"
cask "reflex"
cask "screen-studio"
cask "slack"
cask "tableplus"
cask "telegram-desktop"
cask "the-unarchiver"
cask "tinkerwell"
cask "transmit"
cask "tunnelbear"
cask "tuple"
cask "visual-studio-code"
cask "warp"
cask "zoom"

# Fonts
cask "font-lato"
cask "font-open-sans"
cask "font-roboto"
cask "font-source-code-pro"
cask "font-source-code-pro-for-powerline"
cask "font-source-sans-pro"
cask "font-source-serif-pro"

# Mac App Store (MAS)
mas "AdBlock", id: 1402042596
mas "Byword", id: 420212497
mas "EZVIZ HD", id: 1594552558
mas "Giphy Capture", id: 668208984
mas "GarageBand", id: 682658836
mas "Keynote", id: 409183694
mas "MyWoosh", id: 1498889644
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Speedtest", id: 1153157709
mas "Spring", id: 1508706541
mas "Things", id: 904280696
mas "WhatsApp", id: 310633997
