tap "minio/stable"
tap snowflakedb/snowflake-cli
brew "argocd"
brew "autojump"
brew "awscli"
brew "bash"
brew "bat"
brew "coreutils"
brew "fzf"
brew "gh"
brew "gifsicle"
brew "git"
brew "go"
brew "grep"
brew "jq"
brew "kind"
brew "kubernetes-cli"
brew "kustomize"
brew "mackup"
brew "mas"
brew "neovim"
brew "pipx"
brew "pkgconf"
brew "podman"
brew "podman-compose"
brew "pre-commit"
brew "pure"
brew "ripgrep"
brew "rust"
brew "task"
brew "terraform"
brew "tree"
brew "uv"
brew "yarn"
brew "zsh-syntax-highlighting"
brew "minio/stable/mc"
cask "caffeine"
cask "cursor"
cask "dbeaver-community"
cask "font-fira-code-nerd-font"
cask "github"
cask "google-chrome"
cask "imageoptim"
cask "iterm2"
cask "obsidian"
cask "postman"
cask "postman-cli"
cask "qlmarkdown"
cask "slack"
cask "visual-studio-code"
cask "warp"
vscode "anthropic.claude-code"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "postman.postman-for-vscode"
brew "snowflake-cli"
brew "direnv"
